/*
 * Глава 4. Вариант А. Задание 18.
 * Создать объект класса Пианино, используя классы Клавиша, Педаль. Методы: настроить, играть на пианино, нажимать клавишу.
 * Глава 8. Вариант А.
 * Проконтролировать состояние потоков ввода/вывода. При возникновении ошибок, связанных с корректностью выполнения математических операций, генерировать и обрабатывать исключительные ситуации.
 * Предусмотреть обработку исключений, возникающих при нехватке памяти, отсутствии требуемой записи (объекта) в файле, недопустимом значении поля и т. д.
 */

public class Main {

    public static void main(String[] args) throws PianoException {
        Piano piano = new Piano(new Key(), new Pedal());
        System.out.println(piano.tunePiano());
        System.out.println(piano.pressKey());
        System.out.println(piano.playPiano());
        System.out.println(piano.toString());
    }
    
}
